In [174]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os
import re

## 1. Análise Exploratória

### Valor total vendido e Valor total da meta por ano?

In [44]:
# Pegar todas os arquivos Vendas.xlsx
all_filenames = os.listdir('../archives/vendas/')

# Combinando todos os arquivos Vendas.xlsx em um único dataframe
combined_dataframe = pd.concat([pd.read_excel(f'../archives/vendas/{b}') for b in all_filenames])

In [263]:
all_dataframes_per_year = [pd.read_excel(f'../archives/vendas/{b}') for b in all_filenames]

In [115]:
# Total de vendas
sales_amount = (combined_dataframe.QtdItens * combined_dataframe.ValorUnitario).sum()

In [259]:
# Metas de vendas
goals_dataframe = pd.read_excel('../archives/base-meta-new.xlsx')

In [260]:
# Pegando somente o valor das metas
goals_dataframe = goals_dataframe.iloc[3:,1:]

In [116]:
# Valor total das metas
sales_goal = goals_dataframe.sum()

,DataEmissao,DataVencimento,NFe,cdCliente,cdVendedor,cdProduto,QtdItens,ValorUnitario,Peso Líquido
0,2017-01-12,2017-02-22,1492762,3140218,265,1073,6,8.83,0.60
1,2017-01-12,2017-02-22,1492762,3140218,265,1420,6,4.44,5.40
2,2017-01-12,2017-02-22,1492762,3140218,265,264,10,0.96,1.92
3,2017-01-13,2017-01-29,1492719,2983332,265,1154,6,2.92,1.26
4,2017-01-13,2017-01-29,1492719,2983332,265,1527,6,2.81,1.40
...,...,...,...,...,...,...,...,...,...
14243,2022-03-12,2022-04-14,2173547,673190,265,202,24,1.62,1.50
14244,2022-03-12,2022-04-14,2173547,673190,265,1154,12,3.25,1.75
14245,2022-03-12,2022-04-14,2173547,673190,265,668,12,3.26,1.00
14246,2022-03-12,2022-04-14,2173547,673190,265,1527,12,3.14,1.00
14247,2022-03-13,2022-04-05,2172961,3771379,215,257,6,4.42,1.20

In [122]:
print(f"Valor total vendido e Valor total da meta: 2017-2022\n")

print(f"-> Meta: R$ {sales_goal:,.2f}")
print(f"-> Vendas: R$ {sales_amount:,.2f}")

Valor total vendido e Valor total da meta: 2017-2022

-> Meta: R$ 66,384,345.23
-> Vendas: R$ 21,047,835.52

In [279]:
dates_dataframe = pd.read_excel('../archives/Dimensões.xlsx', sheet_name='Data')

In [287]:
merged_dataframe = pd.merge(combined_dataframe, dates_dataframe, left_on='DataEmissao', right_on='Data')

In [286]:
merged_dataframe

,DataEmissao,DataVencimento,NFe,cdCliente,cdVendedor,cdProduto,QtdItens,ValorUnitario,Peso Líquido,Data,Ano,Mes,MesNum,Dia
0,2017-01-12,2017-02-22,1492762,3140218,265,1073,6,8.83,0.60,2017-01-12,2017,Janeiro,1,12
1,2017-01-12,2017-02-22,1492762,3140218,265,1420,6,4.44,5.40,2017-01-12,2017,Janeiro,1,12
2,2017-01-12,2017-02-22,1492762,3140218,265,264,10,0.96,1.92,2017-01-12,2017,Janeiro,1,12
3,2017-01-13,2017-01-29,1492719,2983332,265,1154,6,2.92,1.26,2017-01-13,2017,Janeiro,1,13
4,2017-01-13,2017-01-29,1492719,2983332,265,1527,6,2.81,1.40,2017-01-13,2017,Janeiro,1,13
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
260091,2019-03-12,2019-04-14,2173547,673190,265,202,24,1.62,1.50,2019-03-12,2019,Março,3,12
260092,2019-03-12,2019-04-14,2173547,673190,265,1154,12,3.25,1.75,2019-03-12,2019,Março,3,12
260093,2019-03-12,2019-04-14,2173547,673190,265,668,12,3.26,1.00,2019-03-12,2019,Março,3,12
260094,2019-03-12,2019-04-14,2173547,673190,265,1527,12,3.14,1.00,2019-03-12,2019,Março,3,12
260095,2019-03-13,2019-04-05,2172961,3771379,215,257,6,4.42,1.20,2019-03-13,2019,Março,3,13

### Crie um gráfico de linhas para exibir o comportamento das vendas ao longo do ano de 2021.

### Quantos clientes ativos e inativos temos em nossa empresa?

In [161]:
# Carregando o dataframe de clientes
customer_dataframe = pd.read_excel('../archives/Dimensões.xlsx', sheet_name='Cliente')

In [171]:
# Separando a quantidade de clientes ativos e inativos
actives, inactives = customer_dataframe['Status'].value_counts()

print(f"-> Total de clientes ativos: {actives}")
print(f"-> Total de clientes inativos: {inactives}")

-> Total de clientes ativos: 1364
-> Total de clientes inativos: 47

### Qual a linha de produtos mais vendida?

### Qual foi a quantidade total de produtos vendidos por ano?